Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/drugs_and_medicines/drugs_payment_scheme.html.txt.tmx
Source language: en
Languages: ga

source: Under the Drugs Payment Scheme you pay a maximum of €144 in a calendar month for approved prescribed drugs, medicines and certain appliances for use by yourself and your family in that month
ga: Faoin Scéim Íocaíochta Drugaí, íocann tú €144, ar a mhéid in aghaidh na míosa ar dhrugaí forordaithe, cógais agus roinnt fearas a úsáidfidh tú féin agus do mhuintir sa mhí sin

source: If a reference price has been set for the drugs you are prescribed, this is the price that the HSE will use to calculate your monthly drugs costs
ga: Má socraíodh praghas tagartha do na drugaí a ordaítear duit, is é seo an praghas a úsáidfidh FSS chun do chostais mhíosúla drugaí a ríomh

source: In order to qualify for this scheme, you must be ordinarily resident in Ireland
ga: Chun cáiliú don scéim seo, ní mór go bhfuil gnáthchónaí ort in Éirinn

source: Being ordinarily resident in Ireland means that you have been living here for a minimum of one year or that you intend to live here for a minimum of one year
ga: Ciallaíonn gnáthchónaí a bheith in Éirinn go bhfuil cónaí ort anseo ar feadh bliain amháin, ar a laghad, nó go bhfuil sé beartaithe agat cónaí anseo ar feadh bliain amháin, ar a laghad

source: The scheme covers the person who applied, his or her spouse/partner, and children aged under 18 (or under 23 if in full-time education)
ga: Cumhdaíonn an scéim an duine a rinne iarratas, a c(h)éile/a p(h)áirtnéir, agus a leanaí faoi aois 18 mbliana (nó faoi 23 má tá siad in oideachas lánaimseartha)

source: A dependant who is living in the household and has a physical or mental disability or illness and is unable to fully maintain himself/herself, may be included in the family expenditure regardless of age
ga: Féadtar cleithiúnaí atá ag cónaí sa teaghlach agus atá faoi mhíchumas fisiciúil nó meabhrach nó ar a bhfuil breoiteacht agus nach bhfuil in ann aire iomlán a thabhairt dó/di féin, a chur san áireamh i gcaiteachas an teaghlaigh, gan aird ar aois an duine sin

source: When you register for the scheme, your Local Health Office will issue a plastic swipe card for each person named on the registration form
ga: Nuair a chláraíonn tú don scéim, eiseoidh d’Oifig Áitiúil Sláinte svaidhpchárta plaisteach do gach duine a ainmnítear ar an bhfoirm chlárúcháin

source: You should present this card whenever you are having prescriptions filled
ga: Ba cheart duit an cárta seo a sholáthar nuair a líontar oidis duit

source: You do not have to register with a particular pharmacy for the scheme but for convenience it is advisable to use the same pharmacy in a particular month if you wish to avoid paying more than the maximum €144
ga: Ní gá duit clárú le cógaslann ar leith don scéim ach ar mhaithe le háisiúlacht, moltar duit an chógaslann chéanna a úsáid i gcaitheamh mí ar leith más mian leat a sheachaint níos mó ná an €144 uasta a íoc

source: Claiming a refund for amounts over the threshold
ga: Aisíocaíocht as suimeanna os cionn na tairsí a éileamh

source: If you pay over the maximum, for example because you need to use two or more pharmacies in one month, you can apply for a refund of the amount above the threshold
ga: Má íocann tú níos mó ná an t-uasmhéid, mar shampla, mar gheall gur gá duit dhá chógaslann nó níos mó a úsáid i gcaitheamh mí amháin, féadfaidh tú iarratas a dhéanamh ar aisíocaíocht na suime os cionn na tairsí

source: To apply for a refund, get a claim form from your Local Health Office, online at drugspayment.ie, or by calling 1890 252 919
ga: Chun iarratas a dhéanamh ar aisíocaíocht, is féidir leat foirm éilimh a fháil ó d’Oifig Sláinte Áitiúil, ar líne ag drugspayment.ie, nó trí ghlao ar 1890 252 919

source: Return the completed claim form to the address given on the form
ga: Seol an fhoirm chomhlánaithe éilimh chuig an seoladh a thugtar ar an bhfoirm

source: You can check the status of your application for a refund at drugspayment.ie
ga: Féadfaidh tú stádas d’iarratais ar aisíocaíocht a sheiceáil trí drugspayment.ie

source: Expired Drugs Payment Scheme Cards
ga: Cártaí Éagtha na Scéime Íocaíochta Drugaí

source: Drugs Payment Scheme Cards are issued for a limited time (generally 5 years)
ga: Eisítear Cárta na Scéime Íocaíochta Drugaí do thréimhse theoranta (5 bliana, de ghnáth)

source: When your card expires, you must apply again to obtain a new card
ga: Nuair a éagann do chárta, ní mór duit iarratas a dhéanamh arís chun cárta nua a fháil

source: You can get the forms from your local pharmacy or from your Local Health Office
ga: Féadfaidh tú na foirmeacha iarratais a fháil ó do chógaslann áitiúil nó ó d’Oifig Sláinte Áitiúil

source: Lost or stolen Drugs Payment Scheme Cards
ga: Cártaí na Scéime Íocaíochta Drugaí atá ar iarraidh nó a cailleadh

source: If your Drugs Payment Scheme Card is lost, stolen or damaged, you should contact your Local Health Office
ga: Má chailleann tú do Chárta Scéim Íocaíochta Drugaí nó má ghoidtear é nó má dhéantar díobháil dó, ba cheart duit teagmháil a dhéanamh le d’Oifig Sláinte Áitiúil

source: The application form is available from pharmacies or from your Local Health Office
ga: Tá fáil ar an bhfoirm iarratais ó chógaslanna nó ó d’Oifig Sláinte Áitiúil

source: You can also download the Drug Payment Scheme application form (pdf)
ga: Ina theannta sin, féadfaidh tú foirm iarratais ar an Scéim Íocaíochta Drugaí (pdf) a íoslódáil anseo

source: If you have any difficulties in completing the form, staff in your local pharmacy or Local Health Office can provide advice and assistance
ga: Má bhíonn aon deacrachtaí agat leis an bhfoirm a chomhlánú, is féidir leis an bhfoireann i do chógaslann áitiúil nó d’Oifig Sláinte Áitiúil comhairle agus cúnamh a thabhairt duit

source: Send the completed application to your Local Health Office
ga: Seol an t-iarratas comhlánaithe chuig d’Oifig Sláinte Áitiúil

source: Further information is available from your Local Health Office
ga: Tá fáil ar thuilleadh faisnéise ó d’Oifig Sláinte Áitiúil
